# Run `brew bundle install` from this directory to install everything below.
# Regenerate from the current Mac state with `brew bundle dump --force` (will
# overwrite this file — review the diff before committing).

# CLI tools
brew "awscli"
brew "espeak-ng"
brew "ffmpeg"
brew "gh"
brew "glab"
brew "googleworkspace-cli"
brew "postgresql@16", restart_service: :changed, link: true
brew "python@3.10"
brew "python-tk@3.10", link: true
brew "rclone"
brew "rsync"
brew "rust"
brew "terraform"
brew "vhs"
brew "xcodegen"

# GUI apps
cask "gcloud-cli"
cask "handy"
cask "monitorcontrol"
cask "zulu@25"

# VS Code extensions (Homebrew Bundle installs via `code --install-extension`)
vscode "docker.docker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "redhat.java"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"

# Go tools (Homebrew Bundle installs via `go install`)
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/cmd/goimports"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"

# Global npm packages (Homebrew Bundle installs via `npm install -g`)
npm "@google/gemini-cli"
npm "@openai/codex"
npm "corepack"
npm "dl-librescore"
npm "hyperframes"
npm "wrangler"
